Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ВыборСкладаДляУстановкиЦен/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	Склад = ПолучитьСклад();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Предупреждение("Для подразделения " + СокрЛП(Ломбард) + " не определен склад с видом " + ?(Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"), "«Витрина общая»", "«Витрина ломбарда/ЦЛО»"));
		Элементы.ФормаВыбрать.Доступность = Ложь;
	Иначе
		Элементы.ФормаВыбрать.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Предупреждение("Не выбран склад!", 60);   
	Иначе
		ЭтаФорма.Закрыть(Склад);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьСклад()  
	Если Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
	    ВидСклада = Перечисления.ЛБ_ВидыСкладов.ВитринаОбщая;
	Иначе    
		ВидСклада = Перечисления.ЛБ_ВидыСкладов.Витрина;
	КонецЕсли;	
    Возврат ЛБ_Общиймодуль.ПолучитьСклад(Ломбард, ВидСклада);
КонецФункции


&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Если Значениезаполнено(Ломбард) Тогда  
		Склад = ПолучитьСклад();
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Предупреждение("Для подразделения " + СокрЛП(Ломбард) + " не определен склад с видом " + ?(Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"), "«Витрина общая»", "«Витрина ломбарда/ЦЛО»")); 
			Элементы.ФормаВыбрать.Доступность = Ложь;
		Иначе
			Элементы.ФормаВыбрать.Доступность = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
